# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

n = int(input('Enter ThreeDigit Number:'))
i = n // 100
j = n % 100 // 10
k = n % 10
print(f'{i + j + k} ({i} + {j} + {k})')